exports.seed = (knex, Promise) => {
    return knex('services').del()
        .then(() => {
            return knex('services').insert({
                name: 'Услуга 1',
                description: 'Описание 1 услуги. Описание 1 услуги. Описание 1 услуги. Описание 1 услуги.',
                price: '500',
                info: 'Информация по 1 услуге. Информация по 1 услуге. Информация по 1 услуге. Информация по 1 услуге.',
                active: true
            });
        })
        .then(() => {
            return knex('services').insert({
                name: 'Услуга 2',
                description: 'Описание 2 услуги. Описание 2 услуги. Описание 2 услуги. Описание 2 услуги.',
                price: '800',
                info: 'Информация по 2 услуге. Информация по 2 услуге. Информация по 2 услуге. Информация по 2 услуге.',
                active: false
            });
        })
        .then(() => {
            return knex('services').insert({
                name: 'Услуга 3',
                description: 'Описание 3 услуги. Описание 3 услуги. Описание 3 услуги. Описание 3 услуги.',
                price: '1000',
                info: 'Информация по 3 услуге. Информация по 3 услуге. Информация по 3 услуге. Информация по 3 услуге.',
                active: false
            });
        })
        .then(() => {
            return knex('services').insert({
                name: 'Услуга 4',
                description: 'Описание 4 услуги. Описание 4 услуги. Описание 4 услуги. Описание 4 услуги.',
                price: '300',
                info: 'Информация по 4 услуге. Информация по 4 услуге. Информация по 4 услуге. Информация по 4 услуге.',
                active: true
            });
        })
        .then(() => {
            return knex('services').insert({
                name: 'Услуга 5',
                description: 'Описание 5 услуги. Описание 5 услуги. Описание 5 услуги. Описание 5 услуги.',
                price: '2000',
                info: 'Информация по 5 услуге. Информация по 5 услуге. Информация по 5 услуге. Информация по 5 услуге.',
                active: true
            });
        });
}; 
